# data columns
def data_columns() -> list:
    columns = ['Name', '관광지구분', 'Address', '소재지지번주소', 'Latitude', 'Longitude', '면적',
               'Public Facilities', 'Accommodation', 'Sports and Recreation', 'Rest and Culture',
               'Guest Facilities', 'Support Facilities', '지정일자', '수용인원수', 'Parking Spaces',
               'Introduction', 'Number', 'Management', '데이터기준일자', '제공기관코드']
    return columns

# regions
def data_regions() -> list:
    regions = ["서울특별시", "부산광역시", "인천광역시", "대구광역시", "대전광역시", "광주광역시", "울산광역시",
               "세종특별자치시", "경기도", "충청북도", "충청남도", "경상북도", "경상남도", "전라남도", "전북특별자치도",
               "강원특별자치도", "제주특별자치도"]
    return regions

# regions details
def data_detailed_regions() -> list:
    detailed_regions = {"서울특별시": ['ALL', '서초구', '중랑구', '성북구', '용산구', '강서구', '관악구', '은평구'],
                        "부산광역시": ['ALL', '수영구', '동래구', '기장군', '동구', '영도구', '해운대구',
                                  '중구', '서구', '금정구', '사하구', '남구'],
                        "인천광역시": ['ALL', '강화군', '부평구', '연수구', '남동구', '미추홀구', '옹진군'],
                        "대구광역시": ['ALL', '서구', '북구'],
                        "대전광역시": ['ALL', '중구', '유성구', '서구', '대덕구'],
                        "광주광역시": ['ALL', '서구', '광산구'],
                        "울산광역시": ['ALL', '울주군'],
                        "세종특별자치시": ['ALL'],
                        "경기도": ['ALL', '남양주시', '용인시', '양주시', '연천군', '구리시', '광명시', '파주시',
                                '평택시', '광주시', '가평군', '군포시', '하남시', '여주시', '김포시', '동두천시',
                                '안성시', '고양시', '포천시', '양평군'],
                        "충청북도": ['ALL', '충주시', '보은군', '증평군', '영동군', '제천시', '음성군', '옥천군',
                                 '단양군', '괴산군'],
                        "충청남도": ['ALL', '예산군', '태안군', '금산군', '홍성군', '천안시', '보령시', '계룡시',
                                 '아산시', '부여군', '당진시', '공주시', '서천군', '서산시'],
                        "전라남도": ['ALL', '화순군', '무안군', '영암군', '여수시', '강진군', '구례군', '해남군',
                                 '장성군', '담양군', '진도군', '곡성군', '순천시', '보성군', '목포시', '신안군',
                                 '나주시', '함평군', '광양시', '영광군', '완도군'],
                        "경상북도": ['ALL', '경산시', '안동시', '경주시', '영양군', '울진군', '포항시', '상주시',
                                 '영천시', '고령군', '청송군', '봉화군', '예천군', '청도군', '의성군', '영덕군',
                                 '영주시', '문경시', '칠곡군', '군위군'],
                        "경상남도": ['ALL', '합천군', '창녕군', '함양군', '고성군', '남해군', '통영시', '양산시',
                                 '김해시', '의령군', '진주시', '산청군', '거창군', '거제시', '밀양시', '하동군',
                                 '창원시', '사천시'],
                        "강원특별자치도": ['ALL', '정선군', '삼척시', '영월군', '속초시', '화천군', '홍천군',
                                    '양구군', '춘천시', '태백시', '동해시', '강릉시', '고성군', '횡성군',
                                    '평창군', '양양군', '인제군', '원주시', '철원군'],
                        "전북특별자치도": ['ALL', '익산시', '고창군', '장수군', '진안군', '임실군', '군산시',
                                    '부안군', '무주군', '완주군', '남원시'],
                        "제주특별자치도": ['ALL', '서귀포시', '제주시']}
    return detailed_regions

# public facilities
def data_public_facilities() -> list:
    public_facilities = ["화장실", "전망대", "물품보관함", "수유실", "장애인", "승강기", "쉼터", "음식점", "카페"]
    return public_facilities

# accommodations
def data_accommodations() -> list:
    accommodations = ["카라반", "캠핑장", "글램핑", "펜션", "호텔", "게스트하우스", "야영장", "민박", "콘도"]
    return accommodations